Revit 2027 API
SymbolTypeId.Lx Property
 Symbol lx, indicating unit Lux.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Lx { get; }
Public Shared ReadOnly Property Lx As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Lx {
	ForgeTypeId^ get ();
}
static member Lx : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace